#pragma once
#ifndef __TYPES_H_C2ADBAF2_7B9D_4C93_BE52_AB1F88D2CB54__
#define __TYPES_H_C2ADBAF2_7B9D_4C93_BE52_AB1F88D2CB54__
// SPDX-FileCopyrightText: (c) 2022 The niLang Authors
// SPDX-License-Identifier: MIT

#ifndef __METAL_VERSION__
#  include <stdlib.h>
#  include <math.h>
#endif

//--------------------------------------------------------------------------------------------
//
//  Platform
//
//--------------------------------------------------------------------------------------------
#if defined __APPLE__ && !defined __METAL_VERSION__
// For the TARGET_* macros
#  include "TargetConditionals.h"
#endif

#define niFeatures_Light    10
#define niFeatures_Embedded 20
#define niFeatures_Full     30

#ifdef _FEATURES
#  define niFeatures _FEATURES
#elif defined niEmbedded
#  define niFeatures niFeatures_Embedded
#else
#  define niFeatures niFeatures_Full
#endif

#define niMinFeatures(REQ)  (niFeatures >= REQ)

#ifndef niCAssert
#  ifdef __cplusplus
#    define niCAssert(exp)          typedef char __C_ASSERT__[(exp)?1:-1];
#  else
#    define niCAssert(exp)
#  endif
#endif

#ifdef _DEBUG
#  define niDebug
#else
#  define niRelease
#endif

#ifdef _DEBUG
#  define niBuildDebug
#else
#  define niBuildRelease
#endif

//////////////////////////////////////////////////////////////////////////////////////////////
// < Feature Set 15, no script engine or interop
#if !niMinFeatures(15)
#  define niConfig_NoInterfaceDef
#  define niConfig_NoConstDef
#  define niConfig_NoXCALL

#    define SYNC_WRITE(addr, value) *addr = value
#    define SYNC_INCREMENT(addr) _InterlockedIncrement(addr)
#    define SYNC_DECREMENT(addr) _InterlockedDecrement(addr)

// Atomic, X86, OSX
#  elif defined(__APPLE__) && defined(__MACH__) // OSX
#    define SYNC_INT_TYPE long signed int
#    include <libkern/OSAtomic.h>
niCAssert(sizeof(SYNC_INT_TYPE) == sizeof(int32_t));
static inline SYNC_INT_TYPE _InterlockedIncrement32(SYNC_INT_TYPE* apValue) {
  return OSAtomicIncrement32((int32_t*)apValue);
}
static inline SYNC_INT_TYPE _InterlockedDecrement32(SYNC_INT_TYPE* apValue) {
  return OSAtomicDecrement32((int32_t*)apValue);
}
#    define SYNC_INCREMENT(addr) (_InterlockedIncrement32(addr))
#    define SYNC_DECREMENT(addr) (_InterlockedDecrement32(addr))
#    define SYNC_WRITE(addr,v)   (*(addr)) = (v)
#    define SYNC_READ(addr)      (*addr)

// Atomic, X86, Android
#  elif defined ANDROID
#    define SYNC_INT_TYPE int
#    include <sys/atomics.h>
#    define SYNC_INCREMENT(addr) (__atomic_inc(addr)+1)
#    define SYNC_DECREMENT(addr) (__atomic_dec(addr)-1)
#    define SYNC_WRITE(addr,v)   __atomic_swap(v,addr)
#    define SYNC_READ(addr)      (*addr)

#  endif

//// ALPHA ////////////////////////////////////////////////////////////////////////////////////
#elif defined _M_ALPHA || defined __alpha__ || defined __alpha

#  define niCPUArch "alpha"
#  define ni64           1
#  define niLittleEndian 1
#  define niAlpha        1

//// SuperH (SH4) /////////////////////////////////////////////////////////////////////////////
#elif defined __sh__

#  define niCPUArch "superh"
#  define ni32      1
#  define niSuperH  1

//// MIPS /////////////////////////////////////////////////////////////////////////////////////
#elif defined __MIPS__ || defined __mips__ || defined __mips

#  define niCPUArch "mips"
#  define ni32      1
#  define niMIPS    1

//// PowerPC //////////////////////////////////////////////////////////////////////////////////
#elif defined _M_PPC || defined __powerpc || defined __ppc__ || defined _ARCH_PPC

#  define niCPUArch "ppc"
#  define ni32      1
#  define niPPC     1

#else

#  error "No CPU Detected."

#endif

///////////////////////////////////////////////////////////////////////////////////////////////
// Default Sync implementations - UNSAFE, not Synchronized
#ifndef SYNC_INT_TYPE
#  pragma error("=== SYNC_INT_TYPE not detected")
#endif

#ifndef SYNC_READ
#  pragma message("=== SYNC_READ not defined, using default UNSAFE operation")
#  define SYNC_READ(addr) *addr
#endif

#ifndef SYNC_WRITE
#  pragma message("=== SYNC_WRITE not defined, using default UNSAFE operation")
#  define SYNC_WRITE(addr, value) *addr = value
#endif

#ifndef SYNC_INCREMENT
#  pragma message("=== SYNC_INCREMENT not defined, using default UNSAFE operation")
#  define SYNC_INCREMENT(addr) (++*addr)
#endif

#ifndef SYNC_DECREMENT
#  pragma message("=== SYNC_DECREMENT not defined, using default UNSAFE operation")
#  define SYNC_DECREMENT(addr) (--*addr)
#endif

niCAssert(sizeof(SYNC_INT_TYPE) == 4); /* Should be a 32bit integer */

#ifdef __cplusplus
namespace ni {
#endif

typedef SYNC_INT_TYPE tSyncInt;

#ifdef __cplusplus
}
#endif

///////////////////////////////////////////////////////////////////////////////////////////////
// Endianess
#if !defined niLittleEndian && !defined niBigEndian
#  if defined __LITTLE_ENDIAN__
#    define niLittleEndian 1
#  elif defined __BIG_ENDIAN__
#    define niBigEndian 1
#  endif
#endif

///////////////////////////////////////////////////////////////////////////////////////////////
// 'Computed' CPU macros
#if !defined niCPUEndian
#  if defined niLittleEndian
#    define niCPUEndian "le"
#  elif defined niBigEndian
#    define niCPUEndian "be"
#  endif
#endif

#if !defined niCPUWordSize
#  if defined ni16
#    define niCPUWordSize 16
#  elif defined ni32
#    define niCPUWordSize 32
#  elif defined ni64
#    define niCPUWordSize 64
#  endif
#endif

///////////////////////////////////////////////////////////////////////////////////////////////
#ifndef niCPUArch
#  pragma message("E/C++ Preprocessor: niCPUArch not defined.")
#endif
#ifndef niCPUEndian
#  pragma message("E/C++ Preprocessor: niCPUEndian not defined.")
#endif
#ifndef niCPUWordSize
#  pragma message("E/C++ Preprocessor: niCPUWordSize not defined.")
#endif

//////////////////////////////////////////////////////////////////////////////////////////////
// Platform specific headers (OS)

#ifndef niPlatformDetected
#  include "Platforms/MetalSL.h" // Metal shader language
#endif

#ifndef niPlatformDetected
#  include "Platforms/OSX.h" // OSX
#endif

#ifndef niPlatformDetected
#  include "Platforms/IOS.h" // IOS
#endif

#ifndef niPlatformDetected
#  include "Platforms/WinRT.h" // VC++ and WinRT
#endif

#ifndef niPlatformDetected
#  include "Platforms/MSVC.h" // VC++ or Intel C++ and Win32
#endif

#ifndef niPlatformDetected
#  include "Platforms/GCCW32.h" // GCC and Win32
#endif

#ifndef niPlatformDetected
#  include "Platforms/Android.h" // GCC and Android
#endif

#ifndef niPlatformDetected
#  include "Platforms/JSCC.h" // HTML5/JS
#endif

#ifndef niPlatformDetected
#  include "Platforms/Linux.h" // Linux
#endif

#ifndef niPlatformDetected
#  include "Platforms/QNX.h" // QNX
#endif

#ifndef niPlatformDetected
#  error "No Platform Detected."
#endif

// Build the SDK without any error infos nor logging
//#define _REDIST

#ifndef _REDIST
#  define niConfig_LogSourceCodeInfo
#endif

// Build the SDK without support for any graphics rendering to a window or output device
//#define niConfig_ConsoleOnly

// Try to generate the minimum size for the module def (includes the interop wrappers)
// Enabled automatically if MinCodeSize is specified
//#define niConfig_MinModuleDefSize

// Will no define the interfaces, nor enums, nor constants in the module's GetModuleDef
// This reduces the DLL size, but all features the automation will not be available.
// The automation is necessary for scripting and automated serialization.
//#define niConfig_OnlyObjectTypesIDL

#ifdef __GNUC__
#  undef NULL
// This disable 'most' (yup GCC can't get everything right...) the retarded
// 'arithmetic with NULL' crap...
#  define NULL 0
#  undef __forceinline
#  define __forceinline inline
#endif

#ifndef __forceinline
#  ifdef __GNUC__
//!!! DO NOT USE __attribute__((__always_inline__)), GCC on Android (NDK4, GCC
//!!! 4.4.0) generate crashy executables when used ... (yes GCC is awesome)
#    define __forceinline inline
#  elif defined niMSVC
// MSVC has __forceinline as a keyword
#  else
#    pragma message("E/C++ Preprocessor: __forceinline not defined.")
#  endif
#endif

#ifndef __noinline
#  ifdef __GNUC__
#    define __noinline __attribute__ ((noinline))
#  elif defined niMSVC
#    define __noinline __declspec(noinline)
#  else
#    pragma message("E/C++ Preprocessor: __noinline not defined.")
#  endif
#endif

// No platform detected
#if !defined niPlatformDetected
#  pragma message("E/C++ Preprocessor: No supported platform detected.")
#endif

#if !defined __ni_export_call_decl
#  define __ni_export_call_decl __cdecl
#endif

#ifdef __cplusplus
#  define niExternC extern "C"
#else
#  define niExternC extern
#endif

#if !defined __ni_module_export
#  ifdef niNoDLL
#    define __ni_module_export
#  elif defined __GNUC__
#    define __ni_module_export  __attribute__((visibility("default")))
#  elif defined niMSVC
#    define __ni_module_export __declspec(dllexport)
#  else
#    pragma message("E/C++ Preprocessor: __ni_module_export not defined.")
#  endif
#endif

#if !defined __ni_module_import
#  ifdef niNoDLL
#    define __ni_module_import
#  elif defined __GNUC__
#    define __ni_module_import  __attribute__((visibility("default")))
#  elif defined niMSVC
#    define __ni_module_import __declspec(dllimport)
#  else
#    pragma message("E/C++ Preprocessor: __ni_module_import not defined.")
#  endif
#endif

#define niExportFunc(TYPE) niExternC __ni_module_export TYPE __ni_export_call_decl
#define niExportFuncCPP(TYPE) extern __ni_module_export TYPE __ni_export_call_decl

#ifndef niUCharSize
#  pragma message("E/C++ Preprocessor: niUCharSize not defined in the platform header")
#endif

#ifndef niStackBufferSize
// Size of a buffer allocated on the stack 8Kb
#  define niStackBufferSize 0x2000
#endif

#ifndef niStandardTypesAlignment
#  define niStandardTypesAlignment 8
#endif

// Exceptions
#ifdef niNoExceptions
#  define niTry()
#  define niCatchAll() if(0)
#  define niCatch(X) if(0)
#  define niThrow(X) ;
#  define niThrowSpec()
#else
#  define niTry()      try
#  define niCatch(X)   catch(X)
#  define niCatchAll() catch(...)
#  define niThrow(X)   throw X
#  define niThrowSpec() throw()
#endif

#ifdef niDebug
#  define niBuildType "Debug"
#else
#  define niBuildType "Release"
#endif

#ifdef __cplusplus
#  define niNamespace(NAME,IDENT) NAME::IDENT
#  define niGlobalNamespace(IDENT)  ::IDENT
#else // __cplusplus
#  define niNamespace(NAME,IDENT) IDENT
#  define niGlobalNamespace(IDENT)  IDENT
#endif // __cplusplus

#ifndef niPP_Comma
// not a joke... needed in for example: REGISTER_EVENTCLASS_EX(CCStatusMovement, cEventClass_CCStatus<CC_COLLIDE_STATUS_MSG niPP_Comma eCollideCharacterStatus_Collide>);
#  define niPP_Comma ,
#endif

///////////////////////////////////////////////////////////////////////////////////////////////
// 'Computed' OS macros
#if defined niWindows
#  define niOS "nt"
#elif defined niOSX
#  define niOS "osx"
#elif defined niIOS
#  define niOS "ios"
#elif defined niAndroid
#  define niOS "adr"
#elif defined niLinux
#  define niOS "linux"
#elif defined niJSCC
#  define niOS "jscc"
#elif defined niMetalSL
#  define niOS "metalsl"
#elif defined niQNX
#  define niOS "qnx"
#else
#  error "E/C++ Preprocessor: Unknown OS."
#endif

///////////////////////////////////////////////////////////////////////////////////////////////
// 'Computed' Linker macro
#if defined niMSVC
#  define niLinker "vc"
#elif defined niGCC || defined niJSCC || defined niCLang
#  define niLinker "gcc"
#elif defined niMetalSL
#  define niLinker "metallib"
#else
#  error "E/C++ Preprocessor: Unknown Linker."
#endif

///////////////////////////////////////////////////////////////////////////////////////////////
// LOA macros
#define niLOA_Libs niLinker "-" niOS "-" niCPUArch
#define niLOA_Bin  niOS "-" niCPUArch

//////////////////////////////////////////////////////////////////////////////////////////////
//
// Allocate a Static objects or Singleton.
//
// The memory is never freed and the destructor is never called.
//
// This is used only for object which are create only ONCE and are
// NEVER destroyed (such as the system object, global memory
// allocators or log systems...)
//
// This allow us to not bother about the destruction order of static
// global objects and still have the program close without crashing.
//
// It WILL leak the memory, but any modern OS cleans the memory of the
// process so it should be irrelevant.
//
// In general singletons should be local to their unit (not global)
// that is why they are declare as 'static' by default.
//
#define niSingleton(TYPE,NAME,PARAMS)           \
  static TYPE* GetSingleton_##NAME() {          \
    niSingletonConstruct(TYPE,NAME,PARAMS);     \
    return s_##NAME;                            \
  }

// Construct a singleton 'in-place'
#define niSingletonConstruct(TYPE,NAME,PARAMS)              \
  static tU8 s_##NAME##_Mem[sizeof(TYPE)];                  \
  static TYPE* s_##NAME = new(s_##NAME##_Mem) TYPE PARAMS;  \

// Declare a singleton prototype (forward declaration)
#define niSingletonPrototype(TYPE,NAME)         \
  static TYPE* GetSingleton_##NAME();

//////////////////////////////////////////////////////////////////////////////////////////////
// Default definitions if not defined in the platform specific headers.
#ifdef __cplusplus
namespace ni {
#endif // __cplusplus
/** \addtogroup niLang
 * @{
 */

#if !defined niLittleEndian && !niBigEndian
#  pragma message("E/C++ Preprocessor: Endianess not defined in the platform header")
#endif

#ifndef niPragmaPack
#  pragma message("E/C++ Preprocessor: niPragmaPack not defined in the platform header")
#endif

#ifndef niPackPush
#  pragma message("E/C++ Preprocessor: niPackPush not defined in the platform header")
#endif

#ifndef niPackPop
#  pragma message("E/C++ Preprocessor: niPackPop not defined in the platform header")
#endif

#ifndef niPacked
#  pragma message("E/C++ Preprocessor: niPacked attribute not defined in the platform header")
#endif

#ifndef niTypeCChar
#  pragma message("E/C++ Preprocessor: niTypeCChar not defined, fix the platform header.")
#endif

#ifndef niTypeUChar
#  pragma message("E/C++ Preprocessor: niTypeUChar not defined, fix the platform header.")
#endif

#if !defined niNoDLL && !defined niDLLSuffix
#  pragma message("E/C++ Preprocessor: Both niDLLSuffix not defined, fix the platform header.")
#endif

#ifndef niConsoleMain
#  define niConsoleMain() int __no_niConsoleMain_on_this_platform[-1];
#endif

#ifndef niWindowedMain
#  define niWindowedMain() int __no_niWindowedMain_on_this_platform[-1];
#endif

#ifndef niHidden
#  if defined niGCC || defined niCLang
#    define niHidden   __attribute__((visibility("hidden")))
#  else
#    define niHidden
#  endif
#endif

#ifndef niAligned
#  if defined(_MSC_VER)
#    define niAligned(x) __declspec(align(x))
#  else
#    define niAligned(x) __attribute__((aligned(x)))
#  endif
#endif

#define niAlignedType(t,x) t niAligned(x)

#ifdef __cplusplus
template <typename T>
inline const T AlignComputePadding(const T align, const T offset) {
  return (align - (offset % align)) % align;
}
template <typename T>
inline const T AlignOffset(const T align, const T offset) {
  return offset + ((align - (offset % align)) % align);
}
#endif

#define niAlignTo(size, alignment) (((size) + (alignment) - 1) & ~((alignment) - 1))

#ifndef niThreadLocal
#  if defined __GNUC__ || defined __SUNPRO_C  || defined __xlC__
#    define niThreadLocal __thread
#  elif __STDC_VERSION__ >= 201112L && !defined __STDC_NO_THREADS__
#    define niThreadLocal _Thread_local
#  elif defined _WIN32 && _MSC_VER >= 1400
#    define niThreadLocal __declspec(thread)
#  endif
#endif

// Detect C++11 thread_local support
#ifdef __cplusplus
#  if defined(__MINGW32__)
// mingw clang does not support non-trivial destructible types. mingw gcc is
// still broken ( https://gcc.gnu.org/bugzilla/show_bug.cgi?id=83562), new gcc
// defines __has_feature but no cxx_thread_local
#  elif (__clang__ + 0)
// clang defines _MSC_VER as the cl builds it, or masquerades as gcc4.2, so
// check clang first
#    if __has_feature(cxx_thread_local)
#      define niCPP_ThreadLocal (!(_LIBCPP_VERSION + 0)/*gnu stl, vcrt*/ || _LIBCPP_VERSION >= 4000)
#    endif
#  elif (_MSC_VER+0) >= 1900
#    define niCPP_ThreadLocal 1
#  elif (__GNUC__*100+__GNUC_MINOR__) >= 408 // can't be clang
// libstdc++(g++4.8+) and libc++4.0+(not apple). implemented in
// __cxa_thread_atexit in libc++abi, 4.0+ abi has a fallback if no
// __cxa_thread_atexit_impl (e.g. android<23)
#    define niCPP_ThreadLocal 1
#  endif
#endif

#if !defined niThreadLocal11 && defined __cplusplus
// define niThreadLocal11
#  if (niCPP_ThreadLocal+0)
#    define niThreadLocal11 thread_local
#  elif defined _WIN32 && _MSC_VER >= 1400
#    define niThreadLocal11 __declspec(thread)
#  endif
#endif

#ifdef __cplusplus
#  ifndef niTAssert
template <bool B> struct sTAssert {};
template <> struct sTAssert<true> { static void TAssert() {}; };
#    define niTAssert(__a) {const bool __b = (__a) ? true : false; sTAssert<__b>::TAssert();}
#  endif
#endif

#ifndef niTypename
#  define niTypename
#endif

#ifndef niSync
#  define niSync volatile
#endif

#ifndef niOverride
#  ifdef niCPP11
#    define niOverride override
#  else
#    define niOverride
#  endif
#endif

#ifndef niFinal
#  ifdef niCPP11
#    define niFinal final
#  else
#    define niFinal
#  endif
#endif

// Implies support for lambda "[]() { ... }" construct, the auto keyword and move semantic (&&)
#ifndef niCPP_Lambda
#  ifdef niCPP11
#    define niCPP_Lambda
#  endif
#endif

// niLambda* macros, much easier to search for than []()
#ifdef niCPP_Lambda
#  define niLambdaByVal     [=]
#  define niLambdaByRef     [&]
#  define niLambda(capture) [capture]
#else
#  define niLambdaByVal     (*no_lambda_support) // deref an unknown symbol so it should be the first error printed
#  define niLambdaByRef     (*no_lambda_support)
#  define niLambda(capture) (*no_lambda_support)
#endif

#define niImpl niOverride niFinal

#ifndef niEndMain
#  define niEndMain(x) ni::GetLang()->Exit(x); return x;
#endif

#ifndef niPluginEntryPoint
#  ifdef _LIB
#    define niPluginEntryPoint(plugname, epname)  _##epname##plugname
#  else
#    define niPluginEntryPoint(plugname, epname)  epname
#  endif
#endif

#ifndef niCountOf
#  define niCountOf(a)                                \
  ((sizeof(a) / sizeof(*(a))) /                       \
   static_cast<size_t>(!(sizeof(a) % sizeof(*(a)))))
#endif

#ifndef niCompileTypeCheck
#  define niCompileTypeCheck(TYPE)    ((void)((TYPE*)(NULL)))
#endif

#ifndef niLoopStdScope
#  define niLoopStdScope  // if(0){} else // Was needed for VC++ 6, probably not necessary anywhere anymore though
#endif

#define niLoop(IDX,COUNT)   niLoopStdScope for (niNamespace(ni,tInt) IDX = 0, __c##IDX = niNamespace(ni,tInt)(COUNT); IDX < __c##IDX; ++IDX)
#define niLoopr(IDX,COUNT)  niLoopStdScope for (niNamespace(ni,tInt) IDX = niNamespace(ni,tInt)((COUNT)-1); IDX >= 0; --IDX)
#define niLoopit(IT,ITN,C)  niLoopStdScope for (IT ITN = (C).begin(); ITN != (C).end(); ++ITN)
#define niLooprit(IT,ITN,C) niLoopStdScope for (IT ITN = (C).rbegin(); ITN != (C).rend(); ++ITN)

#if defined __cplusplus && !defined niNoPointer
template <typename T>
__forceinline bool IsOK(const T* p) {
  return (p != NULL) && (p->IsOK());
}
#  define niIsOK(x)  ni::IsOK(x)

template <typename T>
__forceinline bool IsNullPtr(const T* p) {
  return (p == NULL);
}

#  define niIsNullPtr(x) ni::IsNullPtr(x)
#  define niGetIfOK(x) (niIsOK(x) ? (x) : (NULL))
#endif

#ifndef niDeprecated
#  if defined(__cplusplus) && (__cplusplus >= 201402L)
#    define niDeprecated(since, replacement) [[deprecated("Since " #since "; use " #replacement)]]
#  elif defined(__GNUC__) || defined(__clang__)
#    define niDeprecated(since, replacement) __attribute__((deprecated))
#  elif defined(_MSC_VER)
#    define niDeprecated(since, replacement) __declspec(deprecated)
#  else
#    define niDeprecated(since, replacement)
#  endif
#endif // niDeprecated

#ifdef __cplusplus
}
#endif // __cplusplus

#if !defined niShaderLanguage
// Sets whether we should show a message box for asserts & fatal errors before
// exiting or breaking in the debugger. Defaults to 0 (disabled) and can be
// overwritten with the 'niLang.ShowAssertMessageBox' property.
niExportFunc(int)  ni_debug_get_show_assert_message_box();
niExportFunc(void) ni_debug_set_show_assert_message_box(int aShowAssertMessageBox);
// Return 1 if we should break in the debugger / crash.
niExportFunc(int)  ni_debug_assert(int expression, const char* exp, const char* file, int line, const char* func, int* alwaysignore, const char* desc);
#endif

///////////////////////////////////////////////////////////////////////////////////////////////
// ni_debug_break
#if defined niShaderLanguage
#  define ni_debug_break()

#elif defined niMSVC
#  define ni_debug_break __debugbreak

#else
#  include <signal.h>

/* Use __builtin_trap() on AArch64 iOS only */
#  if defined(__aarch64__) && defined(__APPLE__)
#    define NI_DEBUG_BREAK_PREFER_BUILTIN_TRAP_TO_SIGTRAP 1
#  else
/* gcc optimizers consider code after __builtin_trap() dead,
 * making __builtin_trap() unsuitable for breaking into the debugger */
#  endif

#  if defined(__i386__) || defined(__x86_64__)
#    define NI_HAVE_TRAP_INSTRUCTION 1
__attribute__((always_inline))
__inline__ static void ni_trap_instruction(void) {
  __asm__ volatile("int $0x03");
}
#  elif defined(__thumb__)
#    define NI_HAVE_TRAP_INSTRUCTION 1
/* FIXME: handle __THUMB_INTERWORK__ */
__attribute__((always_inline))
__inline__ static void ni_trap_instruction(void) {
  /* See 'arm-linux-tdep.c' in GDB source.
   * Both instruction sequences below work. */
#    if 1
  /* 'eabi_linux_thumb_le_breakpoint' */
  __asm__ volatile(".inst 0xde01");
#    else
  /* 'eabi_linux_thumb2_le_breakpoint' */
  __asm__ volatile(".inst.w 0xf7f0a000");
#    endif
  /* Known problem:
   * After a breakpoint hit, can't stepi, step, or continue in GDB.
   * 'step' stuck on the same instruction.
   *
   * Workaround: a new GDB command,
   * 'debugbreak-step' is defined in debugbreak-gdb.py
   * that does:
   * (gdb) set $instruction_len = 2
   * (gdb) tbreak *($pc + $instruction_len)
   * (gdb) jump   *($pc + $instruction_len)
   */
}
#  elif defined(__arm__) && !defined(__thumb__)
#    define NI_HAVE_TRAP_INSTRUCTION 1
__attribute__((always_inline))
__inline__ static void ni_trap_instruction(void) {
  /* See 'arm-linux-tdep.c' in GDB source,
   * 'eabi_linux_arm_le_breakpoint' */
  __asm__ volatile(".inst 0xe7f001f0");
  /* Has same known problem and workaround
   * as Thumb mode */
}
#  elif defined(__aarch64__) && defined(__APPLE__)
/* use __builtin_trap() on AArch64 iOS */
#  elif defined(__aarch64__)
#    define NI_HAVE_TRAP_INSTRUCTION 1
__attribute__((always_inline))
__inline__ static void ni_trap_instruction(void) {
  /* See 'aarch64-tdep.c' in GDB source,
   * 'aarch64_default_breakpoint' */
  __asm__ volatile(".inst 0xd4200000");
}
#  else
/* unknown platform, use raise(SIGTRAP) */
#  endif

__attribute__((always_inline))
__inline__ static void ni_debug_break(void) {
#  if defined NI_HAVE_TRAP_INSTRUCTION
  ni_trap_instruction();
#  elif defined NI_DEBUG_BREAK_PREFER_BUILTIN_TRAP_TO_SIGTRAP
  /* raises SIGILL on Linux x86{,-64}, to continue in gdb:
   * (gdb) handle SIGILL stop nopass
   * */
  __builtin_trap();
#  else
#    ifdef _WIN32
  /* SIGTRAP available only on POSIX-compliant operating systems
   * use builtin trap instead */
  __builtin_trap();
#    else
  raise(SIGTRAP);
#    endif
#  endif
}
#endif

///////////////////////////////////////////////////////////////////////////////////////////////
// Trace, Assert, ...
#ifdef __cplusplus
namespace ni {
#endif // __cplusplus

#if !defined __FUNCTION__
#  define __FUNCTION__ __func__
#endif

#ifdef niMSVC
// __PRETTY_FUNCTION__ allow us to get the name of the class, not available on MSVC
#  define __PRETTY_FUNCTION__ __FUNCTION__
#endif

#ifndef niPrint
#  define niPrint(x)  niNamespace(ni,ni_log)(niNamespace(ni,eLogFlags_Raw)|niNamespace(ni,eLogFlags_Stdout)|niNamespace(ni,eLogFlags_NoNewLine),__FILE__,__FUNCTION__,__LINE__,x)
#endif

#ifndef niPrintln
#  define niPrintln(x)  niNamespace(ni,ni_log)(niNamespace(ni,eLogFlags_Raw)|niNamespace(ni,eLogFlags_Stdout),__FILE__,__FUNCTION__,__LINE__,x)
#endif

#if !defined niPrintFmt && defined __cplusplus
#  define niPrintFmt(FMT) {                       \
    ni::cString formatted; formatted.Format FMT;  \
    niPrintln(formatted.Chars());                 \
  }
#endif

#ifndef niAssume
#  define niAssume(x)
#endif

#define niDoAssert(exp)                                                 \
  do {                                                                  \
    static int __ignoreAssert = 0;                                      \
    if(!__ignoreAssert) {                                               \
      if(ni_debug_assert((exp)?1:0, #exp, __FILE__, __LINE__, __FUNCTION__, &__ignoreAssert, NULL)) \
      { ni_debug_break(); }                                             \
    }                                                                   \
  } while(0)

#define niDoAssertMsg(exp, desc)                                        \
  do {                                                                  \
    static int __ignoreAssert = 0;                                      \
    if(!__ignoreAssert) {                                               \
      if(ni_debug_assert((exp)?1:0, #exp, __FILE__, __LINE__, __FUNCTION__, &__ignoreAssert, desc)) \
      { ni_debug_break(); }                                             \
    }                                                                   \
  } while(0)

#define niDoAssertUnreachable(msg)                                      \
  do {                                                                  \
    static int __ignoreAssert = 0;                                      \
    if(!__ignoreAssert) {                                               \
      if(ni_debug_assert(0, msg, __FILE__, __LINE__, __FUNCTION__, &__ignoreAssert, NULL)) \
      { ni_debug_break(); }                                             \
    }                                                                   \
  } while(0)

#ifndef niAssert
#  ifdef _DEBUG
#    define niAssert(exp) niDoAssert(exp)
#  elif defined _LINT
#    define niAssert(exp) niAssume(exp)
#  else
#    define niAssert(exp)
#  endif
#endif

#ifndef niAssertMsg
#  ifdef _DEBUG
#    define niAssertMsg(exp,desc) niDoAssertMsg(exp,desc)
#  elif defined _LINT
#    define niAssertMsg(exp,desc) niAssume(exp)
#  else
#    define niAssertMsg(exp,desc)
#  endif
#endif

#ifndef niAssertUnreachable
#  ifdef _DEBUG
#    define niAssertUnreachable(msg) niDoAssertUnreachable(msg)
#  else
#    define niAssertUnreachable(msg)
#  endif
#endif

#define niDebugAssert niAssert
#define niDebugAssertMsg niAssertMsg
#define niDebugAssertUnreachable niAssertUnreachable

#ifndef niUnused
#  ifdef __cplusplus
#    define niUnused(x) (void)(x);
#  else
#    define niUnused(x)
#  endif
#endif

#ifndef niBit
#  define niBit(x)         ((niNamespace(ni,tU32))(1<<(x)))
#endif

#ifndef niBit64
#  define niBit64(x)       ((niNamespace(ni,tU64))(((niNamespace(ni,tU64))1)<<((niNamespace(ni,tU64))(x))))
#endif

// Define our own macros for writing 64-bit constants. This is less fragile
// than defining __STDC_CONSTANT_MACROS before including <stdint.h>, and it
// works on compilers that don't have it (like MSVC).
#ifdef niMSVC
#  define niU64Const(x)      (x ## UI64)
#  define niI64Const(x)      (x ## I64)
#  ifdef ni64
#    define niIntPtrConst(x) (x ## I64)
#    define niPtrPrefix      "ll"
#  else
#    define niIntPtrConst(x) (x)
#    define niPtrPrefix      ""
#  endif  // ni64
#elif defined niMingW64
#  define niU64Const(x)      (x ## ULL)
#  define niI64Const(x)      (x ## LL)
#  define niIntPtrConst(x)   (x ## LL)
#  define niPtrPrefix        "I64"
#elif defined ni64
#  if defined niOSX
#    define niU64Const(x)    (x ## ULL)
#    define niI64Const(x)    (x ## LL)
#  else
#    define niU64Const(x)    (x ## UL)
#    define niI64Const(x)    (x ## L)
#  endif
#  define niIntPtrConst(x)   (x ## L)
#  define niPtrPrefix        "l"
#else
#  define niU64Const(x)      (x ## ULL)
#  define niI64Const(x)      (x ## LL)
#  define niIntPtrConst(x)   (x)
#  define niPtrPrefix        ""
#endif

// The following macro works on both 32 and 64-bit platforms.
// Usage: instead of writing 0x1234567890123456 write niU64Const2Parts(0x12345678,90123456);
#define niU64Const2Parts(a, b) (((static_cast<ni::tU64>(a) << 32) + 0x##b##u))

#ifndef niConst
#  define niConst const
#endif
#ifndef niConstValue
#  define niConstValue static const
#endif

#ifdef __cplusplus
#  define niDefaultParam(VAL) = VAL
#  define niDefaultTemplate template <typename T>
#else // __cplusplus
#  define niDefaultParam(VAL)
#  define niDefaultTemplate
#endif // __cplusplus

#ifndef niDefaultTypeT
#  define niDefaultTypeT  niNamespace(ni,tF32)
#endif

#define niSafeFloatDiv

/**@}*/
#ifdef __cplusplus
}
#endif // __cplusplus

//--------------------------------------------------------------------------------------------
//
//  PanicAssert
//
//--------------------------------------------------------------------------------------------
#ifdef __cplusplus
namespace ni {
#endif // __cplusplus
/** \addtogroup niLang
 * @{
 */

niExportFunc(void) ni_panic_assert(
    int expression,
    const char* exp,
    const char* file,
    int line,
    const char* func,
    const char* desc);

#ifndef niPanicAssert
#define niPanicAssert(exp)                                              \
  niAssume(exp);                                                        \
  if (!(exp)) {                                                         \
    niNamespace(ni,ni_panic_assert)((exp)?1:0, #exp, __FILE__, __LINE__, __FUNCTION__, NULL); \
  }
#endif

#ifndef niPanicAssertMsg
#define niPanicAssertMsg(exp,msg)                                       \
  niAssume(exp);                                                        \
  if (!(exp)) {                                                         \
    niNamespace(ni,ni_panic_assert)((exp)?1:0, #exp, __FILE__, __LINE__, __FUNCTION__, msg); \
  }
#endif

#ifndef niPanicUnreachable
#define niPanicUnreachable(...)                                         \
  niNamespace(ni,ni_panic_assert)(0, "UNREACHABLE", __FILE__, __LINE__, __FUNCTION__, "" __VA_ARGS__);
#endif

/**@}*/
#ifdef __cplusplus
}
#endif // __cplusplus

//--------------------------------------------------------------------------------------------
//
//  Atomic types
//
//--------------------------------------------------------------------------------------------
#ifdef __cplusplus
namespace ni {
#endif // __cplusplus

/** \addtogroup niLang
 * @{
 */

#define niNull    ((void*)0)

#ifdef __cplusplus
class cString; // string class forward declaration
#endif

typedef niTypeI8      tI8;
typedef niTypeU8      tU8;
typedef niTypeI16     tI16;
typedef niTypeU16     tU16;
typedef niTypeI32     tI32;
typedef niTypeU32     tU32;
typedef niTypeI64     tI64;
typedef niTypeU64     tU64;
typedef niTypePtr     tPtr;
typedef niTypeOffset  tOffset;
typedef niTypeIntPtr  tIntPtr;
typedef niTypeUIntPtr tUIntPtr;
typedef niTypeF32     tF32;
#ifdef niTypeF64
typedef niTypeF64     tF64;
#endif
typedef tU32          tVersion;
typedef tU32          tEnum;
typedef tIntPtr       tHandle;
typedef tF32          tFloat;

typedef tI8 tBool;

#define niTrue 1
#define niFalse 0
#ifndef _DEBUG
#  define niTrueInDebug 0
#  define niFalseInDebug 1
#else
#  define niTrueInDebug 1
#  define niFalseInDebug 0
#endif

#ifdef __cplusplus
enum {
  eTrue = 1,
  eFalse = 0,
#  ifndef _DEBUG
  eTrueInDebug = 0,
  eFalseInDebug = 1,
#  else
  eTrueInDebug = 1,
  eFalseInDebug = 0,
#  endif
};
#endif // __cplusplus

typedef niTypeInt  tInt;
typedef niTypeUInt tUInt;
#if defined ni64
typedef niTypeU64  tSize;
#else
typedef niTypeU32  tSize;
#endif

niCAssert(sizeof(tBool) == 1);
niCAssert(sizeof(tI8) == 1);
niCAssert(sizeof(tU8) == 1);
niCAssert(sizeof(tI16) == 2);
niCAssert(sizeof(tU16) == 2);
niCAssert(sizeof(tI32) == 4);
niCAssert(sizeof(tU32) == 4);
niCAssert(sizeof(tI64) == 8);
niCAssert(sizeof(tU64) == 8);
niCAssert(sizeof(tF32) == 4);
#ifdef niTypeF64
niCAssert(sizeof(tF64) == 8);
#endif
#ifndef niNoPointer
niCAssert(sizeof(void*) == sizeof(tPtr));
#endif
#if defined ni64
#  ifndef niTypeIntSize
#    define niTypeIntSize 8
#  endif
#  ifndef niNoPointer
niCAssert(sizeof(void*) == 8);
#  endif
niCAssert(sizeof(tSize) == 8);
niCAssert(sizeof(tOffset) == 8);
niCAssert(sizeof(tIntPtr) == 8);
niCAssert(sizeof(tUIntPtr) == 8);
#elif defined ni32
#  ifndef niTypeIntSize
#    define niTypeIntSize 4
#  endif
#  ifndef niNoPointer
niCAssert(sizeof(void*) == 4);
#  endif
niCAssert(sizeof(tSize) == 4);
niCAssert(sizeof(tOffset) == 4);
niCAssert(sizeof(tIntPtr) == 4);
niCAssert(sizeof(tUIntPtr) == 4);
#else
#  pragma message("E/C++ Preprocessor: Machine word size not supported.")
#endif

#if niTypeIntSize == 4
niCAssert(sizeof(tInt) == 4);
niCAssert(sizeof(tUInt) == 4);
#elif niTypeIntSize == 8
niCAssert(sizeof(tInt) == 8);
niCAssert(sizeof(tUInt) == 8);
#else
#  error "No valid tInt size defined"
#endif

#if niPragmaPack
#  pragma pack(push,1)
#endif
typedef struct { tU16 w;  tU8  b; } niPacked(1)   tU24;
typedef struct { tU32 dw; tU8  b; } niPacked(1)   tU40;
typedef struct { tU32 dw; tU16 w; } niPacked(1)   tU48;
typedef struct { tU32 dw; tU16 w; tU8 b; } niPacked(1)  tU56;
niCAssert(sizeof(tU24) == 3);
niCAssert(sizeof(tU40) == 5);
niCAssert(sizeof(tU48) == 6);
niCAssert(sizeof(tU56) == 7);
#if niPragmaPack
#  pragma pack(pop)
#endif

niCAssert(((tIntPtr)-1) < 0);
niCAssert(((tUIntPtr)-1) > 0);
niCAssert(((tOffset)-1) < 0);
niCAssert(((tSize)-1) > 0);

//! Index type.
typedef tU32 tIndex;

#define niInvalidHandle 0xDEADBEEF

#if !defined niShaderLanguage
niConstValue tU32 kFeatures = niFeatures;

niConstValue tBool kTrue = niTrue;
niConstValue tBool kFalse = niFalse;

niConstValue tU32 eInvalidHandle = niInvalidHandle;
niConstValue tU32 kInvalidHandle = 0xDEADBEEF;
static inline tBool IsValidHandle(tU32 x)   { return x != eInvalidHandle; }
#endif

#define niMaxI8  0x7f                   //! max possible I8 value
#define niMinI8  -128                   //! min possible I8 value
#define niMaxU8  0xff                   //! max possible U8 value
#define niMinU8  0x00                   //! min possible U8 value
#define niMaxI16 0x7fff                 //! max possible I16 value
#define niMinI16 (-32768)               //! min possible I16 value
#define niMaxU16 0xffff                 //! max possible U16 value
#define niMinU16 0x0000                 //! min possible U16 value
#define niMaxI32 ((niNamespace(ni,tI32))0x7fffffffL) //! max possible I32 value
#define niMinI32 ((niNamespace(ni,tI32))0x80000000) //! min possible I32 value
#define niMaxU32 0xffffffffUL           //! max possible U32 value
#define niMinU32 0x00000000UL           //! min possible U32 value
#define niMaxI64 ((niNamespace(ni,tI64))0x7fffffffffffffffLL) //! max possible I64 value
#define niMinI64 ((niNamespace(ni,tI64))0x8000000000000000LL) //! min possible I64 value
#define niMaxU64 ((niNamespace(ni,tU64))0xffffffffffffffffULL) //! max possible U64 value
#define niMinU64 ((niNamespace(ni,tU64))0x0000000000000000ULL) //! min possible U64 value

#ifdef ni64
#  define niMinIntPtr niMinI64
#  define niMaxIntPtr niMaxI64
#  define niMinUIntPtr niMinU64
#  define niMaxUIntPtr niMaxU64
#else
#  define niMinIntPtr niMinI32
#  define niMaxIntPtr niMaxI32
#  define niMinUIntPtr niMinU32
#  define niMaxUIntPtr niMaxU32
#endif

#ifndef niMaxF32
#  define niMaxF32 3.402823466e+38F //! max possible F32 value
#endif
#ifndef niMinF32
#  define niMinF32 1.175494351e-38F //! min possible F32 value
#endif
#ifndef niEpsilonF32
#  define niEpsilonF32 1.192092896e-07F //! Smallest such that 1.0+niEpsilonF32 !=1.0
#endif
#ifndef niMinExpF32
#  define niMinExpF32 (-125)
#endif
#ifndef niMaxExpF32
#  define niMaxExpF32 (128)
#endif

#ifndef niMaxF64
#  define niMaxF64 1.7976931348623158e+308  //! max possible F64 value
#endif
#ifndef niMinF64
#  define niMinF64 2.2250738585072014e-308  //! min possible F64 value
#endif
#ifndef niEpsilonF64
#  define niEpsilonF64 2.2204460492503131e-016 //! Smallest such that 1.0+niEpsilonF64 !=1.0
#endif
#ifndef niMinExpF64
#  define niMinExpF64 (-1021)
#endif
#ifndef niMaxExpF64
#  define niMaxExpF64 (1024)
#endif

#define niMinVersion  0
#define niMaxVersion  0xFFFFFFFF

#if !defined niShaderLanguage

niConstValue tI8 kMaxI8 = niMaxI8;
niConstValue tI8 kMinI8 = niMinI8;
niConstValue tU8 kMaxU8 = niMaxU8;
niConstValue tU8 kMinU8 = niMinU8;
niConstValue tI16 kMaxI16 = niMaxI16;
niConstValue tI16 kMinI16 = niMinI16;
niConstValue tU16 kMaxU16 = niMaxU16;
niConstValue tU16 kMinU16 = niMinU16;
niConstValue tI32 kMaxI32 = niMaxI32;
niConstValue tI32 kMinI32 = niMinI32;
niConstValue tU32 kMaxU32 = niMaxU32;
niConstValue tU32 kMinU32 = niMinU32;
niConstValue tI64 kMaxI64 = niMaxI64;
niConstValue tI64 kMinI64 = niMinI64;
niConstValue tU64 kMaxU64 = niMaxU64;
niConstValue tU64 kMinU64 = niMinU64;
niConstValue tF32 kMaxF32 = niMaxF32;
niConstValue tF32 kMinF32 = niMinF32;
niConstValue tF32 kEpsilonF32 = niEpsilonF32;
niConstValue tF32 kMaxExpF32 = niMaxExpF32;
niConstValue tF32 kMinExpF32 = niMinExpF32;

#  ifdef niTypeF64
niConstValue tF64 kMaxF64 = niMaxF64;
niConstValue tF64 kMinF64 = niMinF64;
niConstValue tF64 kEpsilonF64 = niEpsilonF64;
niConstValue tF64 kMaxExpF64 = niMaxExpF64;
niConstValue tF64 kMinExpF64 = niMinExpF64;
#  endif

#  ifdef __cplusplus
template<typename T> T TypeMin() { ; /*error*/ }
template<typename T> T TypeMax() { ; /*error*/ }
template<typename T> T TypeEpsilon() { ; /*error*/ }
template<typename T> T TypeZeroTolerance() { ; /*error*/ }
template<typename T> T TypeMinExp() { ; /*error*/ }
template<typename T> T TypeMaxExp() { ; /*error*/ }

template<> inline tI8  TypeMin<tI8>() { return ni::kMinI8; }
template<> inline tI8  TypeMax<tI8>() { return ni::kMaxI8; }
template<> inline tI8  TypeZeroTolerance<tI8>() { return 0; }
template<> inline tU8  TypeMin<tU8>() { return ni::kMinU8; }
template<> inline tU8  TypeMax<tU8>() { return ni::kMaxU8; }
template<> inline tU8  TypeZeroTolerance<tU8>() { return 0; }
template<> inline tI16 TypeMin<tI16>() { return ni::kMinI16; }
template<> inline tI16 TypeMax<tI16>() { return ni::kMaxI16; }
template<> inline tI16 TypeZeroTolerance<tI16>() { return 0; }
template<> inline tU16 TypeMin<tU16>() { return ni::kMinU16; }
template<> inline tU16 TypeMax<tU16>() { return ni::kMaxU16; }
template<> inline tU16 TypeZeroTolerance<tU16>() { return 0; }
template<> inline tI32 TypeMin<tI32>() { return ni::kMinI32; }
template<> inline tI32 TypeMax<tI32>() { return ni::kMaxI32; }
template<> inline tI32 TypeZeroTolerance<tI32>() { return 0; }
template<> inline tU32 TypeMin<tU32>() { return ni::kMinU32; }
template<> inline tU32 TypeMax<tU32>() { return ni::kMaxU32; }
template<> inline tU32 TypeZeroTolerance<tU32>() { return 0; }
template<> inline tI64 TypeMin<tI64>() { return ni::kMinI64; }
template<> inline tI64 TypeMax<tI64>() { return ni::kMaxI64; }
template<> inline tI64 TypeZeroTolerance<tI64>() { return 0; }
template<> inline tU64 TypeMin<tU64>() { return ni::kMinU64; }
template<> inline tU64 TypeMax<tU64>() { return ni::kMaxU64; }
template<> inline tU64 TypeZeroTolerance<tU64>() { return 0; }
template<> inline tF32 TypeMin<tF32>() { return ni::kMinF32; }
template<> inline tF32 TypeMax<tF32>() { return ni::kMaxF32; }
template<> inline tF32 TypeZeroTolerance<tF32>() { return 1e-06f; }
template<> inline tF32 TypeEpsilon<tF32>() { return ni::kEpsilonF32; }
template<> inline tF32 TypeMinExp<tF32>() { return ni::kMinExpF32; }
template<> inline tF32 TypeMaxExp<tF32>() { return ni::kMaxExpF32; }
#    ifdef niTypeF64
template<> inline tF64 TypeMin<tF64>() { return ni::kMinF64; }
template<> inline tF64 TypeMax<tF64>() { return ni::kMaxF64; }
template<> inline tF64 TypeZeroTolerance<tF64>() { return 1e-08; }
template<> inline tF64 TypeEpsilon<tF64>() { return ni::kEpsilonF64; }
template<> inline tF64 TypeMinExp<tF64>() { return ni::kMinExpF64; }
template<> inline tF64 TypeMaxExp<tF64>() { return ni::kMaxExpF64; }
#    endif
#  endif // __cplusplus

#  ifdef __cplusplus

// Use implicit_cast as a safe version of static_cast or const_cast
// for upcasting in the type hierarchy (i.e. casting a pointer to Foo
// to a pointer to SuperclassOfFoo or casting a pointer to Foo to
// a const pointer to Foo).
// When you use implicit_cast, the compiler checks that the cast is safe.
// Such explicit implicit_casts are necessary in surprisingly many
// situations where C++ demands an exact type match instead of an
// argument type convertable to a target type.
//
// The From type can be inferred, so the preferred syntax for using
// implicit_cast is the same as for static_cast etc.:
//
//   implicit_cast<ToType>(expr)
//
// implicit_cast would have been part of the C++ standard library,
// but the proposal was submitted too late.  It will probably make
// its way into the language in the future.
template<typename To, typename From>
inline To implicit_cast(From const &f) {
  return f;
}

// When you upcast (that is, cast a pointer from type Foo to type
// SuperclassOfFoo), it's fine to use implicit_cast<>, since upcasts
// always succeed.  When you downcast (that is, cast a pointer from
// type Foo to type SubclassOfFoo), static_cast<> isn't safe, because
// how do you know the pointer is really of type SubclassOfFoo?  It
// could be a bare Foo, or of type DifferentSubclassOfFoo.  Thus,
// when you downcast, you should use this macro.  In debug mode, we
// use dynamic_cast<> to double-check the downcast is legal (we die
// if it's not).  In normal mode, we do the efficient static_cast<>
// instead.  Thus, it's important to test in debug mode to make sure
// the cast is legal!
//    This is the only place in the code we should use dynamic_cast<>.
// In particular, you SHOULDN'T be using dynamic_cast<> in order to
// do RTTI (eg code like this:
//    if (dynamic_cast<Subclass1>(foo)) HandleASubclass1Object(foo);
//    if (dynamic_cast<Subclass2>(foo)) HandleASubclass2Object(foo);
// You should design the code some other way not to need this.
template<typename To, typename From>     // use like this: down_cast<T*>(foo);
inline To down_cast(From* f) {           // so we only accept pointers
#    if defined _DEBUG && defined _CPPRTTI
#      ifdef niMSVC
  // The try/catch allows to mix RTTI/non-RTTI build on MSVC...
#        pragma warning(push)
#        pragma warning(disable:4530)
  try
#      endif
  {
    To _to = static_cast<To>(f);
    To _dynTo = dynamic_cast<To>(f);
    niAssert(f == NULL || dynamic_cast<To>(f) != NULL);  // RTTI: debug mode only!
    niAssert(_to == _dynTo);
  }
#      ifdef niMSVC
  catch (...) {
  }
#        pragma warning(pop)
#      endif
#    endif
  return static_cast<To>(f);
}

//
// The type-based aliasing rule allows the compiler to assume that pointers of
// different types (for some definition of different) never alias each other.
// Thus the following code does not work:
//
// float f = foo();
// int fbits = *(int*)(&f);
//
// The compiler 'knows' that the int pointer can't refer to f since the types
// don't match, so the compiler may cache f in a register, leaving random data
// in fbits. Using C++ style casts makes no difference, however a pointer to
// char data is assumed to alias any other pointer. This is the 'memcpy
// exception'.
//
// Bit_cast uses the memcpy exception to move the bits from a variable of one
// type of a variable of another type. Of course the end result is likely to
// be implementation dependent. Most compilers (gcc-4.2 and MSVC 2005) will
// completely optimize BitCast away.
//
// There is an additional use for BitCast. Recent gccs will warn when they see
// casts that may result in breakage due to the type-based aliasing rule. If
// you have checked that there is no breakage you can use BitCast to cast one
// pointer type to another. This confuses gcc enough that it can no longer see
// that you have cast one pointer type to another thus avoiding the warning.
//
// We need different implementations of BitCast for pointer and non-pointer
// values. We use partial specialization of auxiliary struct to work around
// issues with template functions overloading.
//
template <class TDest, class TSrc>
struct bit_cast__helper {
  niCAssert(sizeof(TDest) == sizeof(TSrc));
  static TDest cast(const TSrc& source) {
    TDest dest;
    memcpy(&dest, &source, sizeof(dest));
    return dest;
  }
};
template <class TDest, class TSrc>
struct bit_cast__helper<TDest, TSrc*> {
  static TDest cast(TSrc* source) {
    return bit_cast__helper<TDest, tUIntPtr>::
        cast(reinterpret_cast<tUIntPtr>(source));
  }
};
template <class TDest, class TSrc>
inline TDest bit_cast(const TSrc& source) {
  return bit_cast__helper<TDest, TSrc>::cast(source);
}

//! Same as bit_cast but for when the destination type is bigger than the
//! source type. The destination is initialized to zero first.
template <class TDest, class TSrc>
inline TDest bit_castz(const TSrc& source) {
  // Check that the destination type is larger than the source type, zeroing
  // the destination isnt needed if that isnt the case.
  niCAssert(sizeof(TDest) > sizeof(TSrc));
  TDest dest;
  memset(&dest, 0, sizeof(dest));
  memcpy(&dest, &source, sizeof(source));
  return dest;
}

#    define niCCast(TYPE,VAL)     ((TYPE)(VAL))
#    define niUnsafeCast(TYPE,VAL)    reinterpret_cast<TYPE>(VAL)
#    define niIUnknownCast2(IT,VAL)   ni::down_cast<ni::iUnknown*>(ni::down_cast<IT*>(VAL))
#    define niIUnknownCCast2(IT,VAL)    ni::down_cast<const ni::iUnknown*>(ni::down_cast<const IT*>(VAL))
#    define niIUnknownCast(VAL)     ni::down_cast<ni::iUnknown*>(VAL)
#    define niIUnknownCCast(VAL)      ni::down_cast<const ni::iUnknown*>(VAL)
#    define niStaticCast(TYPE,VAL)    ni::down_cast<TYPE>(VAL)
#    define niConstCast(TYPE,VAL)   const_cast<TYPE>(VAL)
#    define niConstStaticCast(CTYPE,STYPE,VAL)    ni::down_cast<STYPE>(const_cast<CTYPE>(VAL))
#    define niThis(CLASS)   niConstCast(CLASS*,this)
#    define niConstThis(CLASS)  niConstCast(const CLASS*,this)
#    define niValCast(TYPE,VAR)  ((TYPE&)(VAR))
#    define niRefCast(TYPE,VAR)  ((TYPE*)&(VAR))
#    define niRef(TYPE)     TYPE&

#  else // __cplusplus

#    define niCCast(TYPE,VAL)           ((TYPE)(VAL))
#    define niUnsafeCast(TYPE,VAL)          ((TYPE)(VAL))
#    define niIUnknownCast(VAL)           ((ni::iUnknown*)(VAL))
#    define niIUnknownCCast(VAL)            ((ni::iUnknown*)(VAL))
#    define niStaticCast(TYPE,VAL)          ((TYPE)(VAL))
#    define niConstCast(TYPE,VAL)         ((TYPE)(VAL))
#    define niConstStaticCast(CTYPE,STYPE,VAL)    ((TYPE)(VAL))
#    define niValCast(TYPE,VAR)           (*(((TYPE)*)(&(VAR))))
#    define niRefCast(TYPE,VAR)           ((TYPE*)(VAR))
#    define niRef(TYPE)     TYPE*

#    define niDefaultTemplate
#  endif // __cplusplus

static inline tU32 ftoul(tF32 f)  { return *(tU32*)((void*)(&f)); }
static inline tF32 ultof(tU32 u)  { return *(tF32*)((void*)(&u)); }
static inline tI32 ftol(tF32 f) { return *(tI32*)((void*)(&f)); }
static inline tF32 ltof(tI32 u) { return *(tF32*)((void*)(&u)); }
#  ifdef niTypeF64
static inline tU64 dtouq(tF64 f)  { return *(tU64*)((void*)(&f)); }
static inline tF64 uqtod(tU64 u)  { return *(tF64*)((void*)(&u)); }
static inline tI64 dtoq(tF64 f) { return *(tI64*)((void*)(&f)); }
static inline tF64 qtod(tI64 u) { return *(tF64*)((void*)(&u)); }
#  endif

//! UTF8/ascii character.
typedef niTypeCChar    cchar;
typedef niTypeCChar    tCChar;

//! wchar_t character.
typedef niTypeUChar    uchar;
typedef niTypeUChar    tUChar;

#  if niUCharSize == 2
//! UTF16 character.
typedef uchar  gchar;
typedef tUChar tGChar;
//! UTF32 character.
typedef tU32 xchar;
typedef tU32 tXChar;
#  elif niUCharSize == 4
//! UTF16 character.
typedef tU16 gchar;
typedef tU16 tGChar;
//! UTF32 character.
typedef uchar  xchar;
typedef tUChar tXChar;
#  elif niUCharSize == 1
//! UTF16 character.
typedef tU16 gchar;
typedef tU16 tGChar;
//! UTF32 character.
typedef tU32 xchar;
typedef tU32 tXChar;
#  else
#    pragma message("E/C++ Preprocessor: Invalid niUCharSize definition.")
#  endif

niCAssert(sizeof(cchar) == 1);
niCAssert(sizeof(gchar) == 2);
niCAssert(sizeof(xchar) == 4);
#  if niUCharSize == 4
niCAssert(sizeof(uchar) == 4);
#  elif niUCharSize == 2
niCAssert(sizeof(uchar) == 2);
#  else
niCAssert(sizeof(uchar) == 1);
#  endif

niCAssert(sizeof("X"[0]) == 1);
#  if niUCharSize != 1
niCAssert(sizeof(L"X"[0]) == sizeof(uchar));
#  endif

typedef cchar achar;
typedef cchar tAChar;
#  define _A(x) x
#  define niACharIsCChar
niCAssert(sizeof(cchar) == sizeof(achar));

niConstValue tU32 knTypeStringMaxSizeInChar = 32;

#  define niIsStringOK(str)      ((str) && *(str))
#  define niStringIsOK(str)      ((str) && *(str))

#  define AZEROSTR  _A("\0\0\0")
#  define AEOL    _A("\n")
#  define ASPACE    ((achar)(32))

// MAX Size defs
#  define AMAX_DIR  _MAX_DIR  // Maximum length of directory component
#  define AMAX_DRIVE  _MAX_DRIVE  // Maximum length of drive component
#  define AMAX_EXT  _MAX_EXT  // Maximum length of extension component
#  define AMAX_FNAME  _MAX_FNAME  // Maximum length of filename component
#  define AMAX_PATH _MAX_PATH // Maximum length of full path
#  define AMAX_SIZE (AMAX_PATH*2)   // Maximum size of a static const achar string

#  ifdef __cplusplus
// Empty string
template<class T> T* StringEmpty() {
  return (T*)"\0\0\0\0";
}

//! Empty class.
class cEmpty {};
#  endif // __cplusplus

//! UUID type, default/standard variant.
typedef struct tUUID_tag {
  niNamespace(ni,tU32)  nData1;
  niNamespace(ni,tU16)  nData2;
  niNamespace(ni,tU16)  nData3;
  niNamespace(ni,tU8)   nData4[8];
} tUUID;
//! UUID type, time based variant.
typedef struct tUUIDTime_tag {
  niNamespace(ni,tU32)  nTimeLow;
  niNamespace(ni,tU16)  nTimeMid;
  niNamespace(ni,tU16)  nTimeHiAndVersion;
  niNamespace(ni,tU8) nClockSeqReserved;
  niNamespace(ni,tU8) nClockSeqLow;
  niNamespace(ni,tU8)   nNodes[6];
} tUUIDTime;
//! UUID type, 4x64 bits variant
typedef struct tUUID32_tag {
  niNamespace(ni,tU32)  nA;
  niNamespace(ni,tU32)  nB;
  niNamespace(ni,tU32)  nC;
  niNamespace(ni,tU32)  nD;
} tUUID32;
//! UUID type, 2x64 bits variant
typedef struct tUUID64_tag {
  niNamespace(ni,tU64)  nDataHi;
  niNamespace(ni,tU64)  nDataLo;
} tUUID64;
niCAssert(sizeof(tUUID) == 16);
niCAssert(sizeof(tUUIDTime) == 16);
niCAssert(sizeof(tUUID32) == 16);
niCAssert(sizeof(tUUID64) == 16);

//! Number of bytes of a UUID
niConstValue tU32 knUUIDSize = sizeof(tUUID);

//! Zero UUID.
niConstValue tUUID kuuidZero = { 0x00000000,0x0000,0x0000, { 0,0,0,0,0,0,0,0 } };

//! Macro to init a UUID from the uuid generation tool's output (genuuid 2)
#  define niInitUUID(A,B,C,D,E,F,G,H,I,J,K) { A,B,C, { D,E,F,G,H,I,J,K } }
//! Define a UUID from the uuid the uuid generation tool's output (genuuid 2)
#  define niDefineUUID(NAME,A,B,C,D,E,F,G,H,I,J,K)  const ni::tUUID NAME = niInitUUID(A,B,C,D,E,F,G,H,I,J,K);

//! UUID compare
static __forceinline tInt UUIDCmp(const niRef(tUUID) A, const niRef(tUUID) B) {
  return memcmp(&A,&B,sizeof(A));
}
//! UUID equal
static __forceinline tBool UUIDEq(const niRef(tUUID) A, const niRef(tUUID) B) {
#  if niCPUWordSize == 32
  return
      niRefCast(tUUID32,A)->nA == niRefCast(tUUID32,B)->nA &&
      niRefCast(tUUID32,A)->nB == niRefCast(tUUID32,B)->nB &&
      niRefCast(tUUID32,A)->nC == niRefCast(tUUID32,B)->nC &&
      niRefCast(tUUID32,A)->nD == niRefCast(tUUID32,B)->nD;
#  elif niCPUWordSize == 64
  return
      niRefCast(tUUID64,A)->nDataHi == niRefCast(tUUID64,B)->nDataHi &&
      niRefCast(tUUID64,A)->nDataLo == niRefCast(tUUID64,B)->nDataLo;
#  else
#    error "E/C++ Preprocessor: CPU Word size not supported."
#  endif
}

//! Create a local UUID.
//! \remark Faster than a unique UUID, but can be used only on one machine localy.
niExportFunc(tUUID) UUIDGenLocal();
//! Create a global UUID.
niExportFunc(tUUID) UUIDGenGlobal();

#  ifdef __cplusplus
inline bool __stdcall operator == (const tUUID& A,const tUUID& B) { return UUIDEq(A,B); }
inline bool __stdcall operator != (const tUUID& A,const tUUID& B) { return !UUIDEq(A,B); }
inline bool __stdcall operator >  (const tUUID& A,const tUUID& B) { return UUIDCmp(A,B) > 0; }
inline bool __stdcall operator <  (const tUUID& A,const tUUID& B) { return UUIDCmp(A,B) < 0; }
inline bool __stdcall operator >= (const tUUID& A,const tUUID& B) { return UUIDCmp(A,B) >= 0; }
inline bool __stdcall operator <= (const tUUID& A,const tUUID& B) { return UUIDCmp(A,B) <= 0; }
#  endif

//! Type flags.
typedef enum eTypeFlags {
  eTypeFlags_Constant         = 0x00000100,
  eTypeFlags_Pointer          = 0x00000200,
  eTypeFlags_Collectable      = 0x00000400,
  eTypeFlags_Numeric          = 0x00000800,
  eTypeFlags_FUNCPROTO        = 0x00001000,
  eTypeFlags_STRING           = 0x00002000,
  eTypeFlags_TABLE            = 0x00004000,
  eTypeFlags_ARRAY            = 0x00008000,
  eTypeFlags_USERDATA         = 0x00010000,
  eTypeFlags_CLOSURE          = 0x00020000,
  eTypeFlags_NATIVECLOSURE    = 0x00040000,
  eTypeFlags_MethodOptional   = 0x00080000,
  eTypeFlags_MethodSetter     = 0x00100000,
  eTypeFlags_MethodGetter     = 0x00200000,
  eTypeFlags_MethodStatic     = 0x00400000,
  eTypeFlags_ForceDWORD       = 0xFFFFFFFF
} eTypeFlags;

//! Base types enumeration.
typedef enum eType
{
  eType_Null = 0,
  eType_IUnknown = 1,

  eType_FirstGroup4 = 0x10,
  eType_I8 = eType_FirstGroup4+0,
  eType_U8 = eType_FirstGroup4+1,
  eType_I16 = eType_FirstGroup4+2,
  eType_U16 = eType_FirstGroup4+3,
  eType_I32 = eType_FirstGroup4+4,
  eType_U32 = eType_FirstGroup4+5,
  eType_F32 = eType_FirstGroup4+6,
  eType_AChar = eType_FirstGroup4+7,
  eType_LastGroup4 = 0x1F,

  eType_FirstGroup8 = 0x20,
  eType_I64 = eType_FirstGroup8+0,
  eType_U64 = eType_FirstGroup8+1,
  eType_F64 = eType_FirstGroup8+2,
  eType_Vec2f = eType_FirstGroup8+3,
  eType_Vec2i = eType_FirstGroup8+4,
  eType_LastGroup8 = 0x2F,

  eType_FirstGroup12 = 0x30,
  eType_Vec3f = eType_FirstGroup12+0,
  eType_Vec3i = eType_FirstGroup12+1,
  eType_String = eType_FirstGroup12+2,
  eType_LastGroup12 = 0x3F,

  eType_FirstGroup16 = 0x40,
  eType_Vec4f = eType_FirstGroup16+0,
  eType_Vec4i = eType_FirstGroup16+1,
  eType_UUID = eType_FirstGroup16+2,
  eType_LastGroup16 = 0x4F,

  eType_FirstExtended = 0x50,
  eType_Matrixf = eType_FirstExtended+0,
  eType_Variant = eType_FirstExtended+1,
  eType_LastExtended = 0x7F,

  eType_Enum = eType_U32,

  // CPU word size dependant
#  ifdef ni32
  eType_Ptr = eType_U32,
  eType_Size = eType_U32,
  eType_Offset = eType_U32,
  eType_IntPtr = eType_I32,
  eType_UIntPtr = eType_U32,
#  elif defined ni64
  eType_Ptr = eType_U64,
  eType_Size = eType_U64,
  eType_Offset = eType_U64,
  eType_IntPtr = eType_I64,
  eType_UIntPtr = eType_U64,
#  else
#    error "Unknown CPU word size."
#  endif

#  if niTypeIntSize == 4
  eType_Int = eType_I32,
  eType_UInt = eType_U32,
#  elif niTypeIntSize == 8
  eType_Int = eType_I64,
  eType_UInt = eType_U64,
#  else
#    error "No valid tInt size defined"
#  endif

  eType_ASZ = eType_AChar|eTypeFlags_Constant|eTypeFlags_Pointer,
  eType_IUnknownPtr = eType_IUnknown|eTypeFlags_Pointer,

  eType_ForceDWORD = 0xFFFFFFFF
} eType;

typedef tU32  tType;

niConstValue tU32 knMaxSizeOfTypeRetByValue = 64;
niConstValue tU32 knTypeRawNumBits = 7; // number of bits without flags
niConstValue tU32 knTypeMask = 0xFF;
#  define niType(TYPE)      ((eType)(((tType)(TYPE))&knTypeMask))
#  define niTypeIsPointer(TYPE)  ((TYPE) == eType_Ptr || ((TYPE)&eTypeFlags_Pointer))

#  ifdef __cplusplus
struct Var;
#  else
typedef struct Var Var;
#  endif

//! Compare the raw data of the variant.
//! \remark This just compares the bits contained in the variant, not distinction
//!         is made between a float or an integer for example.
niExportFunc(tInt) VarCompare(niConst Var* a, niConst Var* b);
//! Get a Null variant
niExportFunc(const Var*) VarGetNull();
//! Var destructor.
niExportFunc(void) VarDestruct(Var* a);

#  ifdef __cplusplus
#    define niVarNull (*ni::VarGetNull())
#  else
#    define niVarNull VarGetNull()
#  endif

#endif // niShaderLanguage

/**@}*/
#ifdef __cplusplus
}
#endif // __cplusplus

//--------------------------------------------------------------------------------------------
//
//  Memory allocator
//
//--------------------------------------------------------------------------------------------
#if !defined niShaderLanguage
#  ifdef __cplusplus
namespace ni {
#  endif // __cplusplus

/** \addtogroup niLang
 * @{
 */

niExportFunc(void*) ni_malloc(size_t size, const char* file, int line, const char* fun);
niExportFunc(void*) ni_aligned_malloc(size_t size, size_t alignment, const char* file, int line, const char* fun);
niExportFunc(void)  ni_free(void* ptr, const char* file, int line, const char* fun);
niExportFunc(void*) ni_realloc(void* ptr, size_t size, const char* file, int line, const char* fun);
niExportFunc(void*) ni_object_alloc(size_t size, const char* file, int line, const char* fun);
niExportFunc(void) ni_object_free(void* ptr, const char* file, int line, const char* fun);

#  if defined niMalloc || defined niAlignedMalloc || defined niFree || defined niRealloc
#    error("niMalloc, niAlignedMalloc, niFree and niRealloc should not be defined by the platform header.")
#  endif

#  ifdef __cplusplus
template <typename T>
static void ni_delete(T* ptr, const char *f, int l, const char *sf)
{
	if (ptr) {
		ptr->~T();
		ni_object_free(ptr, f, l, sf);
	}
}
#  endif

#  if !defined niEmbedded && !defined _REDIST
#    define niMalloc(size)                  niNamespace(ni,ni_malloc)(size,__FILE__,__LINE__,__FUNCTION__)
#    define niAlignedMalloc(size,alignment) niNamespace(ni,ni_aligned_malloc)(size,alignment,__FILE__,__LINE__,__FUNCTION__)
#    define niFree(ptr)                     niNamespace(ni,ni_free)((void*)(ptr),__FILE__,__LINE__,__FUNCTION__)
#    define niRealloc(ptr,size)             niNamespace(ni,ni_realloc)((void*)(ptr),size,__FILE__,__LINE__,__FUNCTION__)
#    define niNew     new(__FILE__,__LINE__,__FUNCTION__)
#    define niNewM    new(__FILE__,__LINE__,"member_init")
#    define niDelete  delete
#  else
#    define niMalloc(size)                  niNamespace(ni,ni_malloc)(size,NULL,-1,NULL)
#    define niAlignedMalloc(size,alignment) niNamespace(ni,ni_aligned_malloc)(size,alignment,NULL,-1,NULL)
#    define niFree(ptr)                     niNamespace(ni,ni_free)((void*)(ptr),NULL,-1,NULL)
#    define niRealloc(ptr,size)             niNamespace(ni,ni_realloc)((void*)(ptr),size,NULL,-1,NULL)
#    define niNew    new
#    define niNewM   new
#    define niDelete delete
#  endif

// Safe memory freeing
#  ifndef niSafeDelete
#    define niSafeDelete(p)   { if(p) { niDelete p; (p)=NULL; } }
#  endif

#  ifndef niSafeDeleteArray
#    define niSafeDeleteArray(p)  { if(p) { niDelete[] p; (p)=NULL; } }
#  endif

#  ifndef niSafeRelease
#    define niSafeRelease(p)    { if(p) { (p)->Release(); (p)=NULL; } }
#  endif

#  ifndef niSafeInvalidateRelease
#    define niSafeInvalidateRelease(p)  { if(p) { (p)->Invalidate(); (p)->Release();  (p)=NULL; } }
#  endif

#  ifndef niSafeFree
#    define niSafeFree(p)     { if(p) { niFree(p);  (p)=NULL; } }
#  endif

#  define niTMalloc(TYPE,COUNT) (TYPE*)niMalloc(sizeof(TYPE)*(COUNT))

/**@}*/
#  ifdef __cplusplus
}
#  endif // __cplusplus
#endif // niShaderLanguage

//--------------------------------------------------------------------------------------------
//
//  Log
//
//--------------------------------------------------------------------------------------------
#if !defined niShaderLanguage
#  ifdef __cplusplus
namespace ni {
#  endif // __cplusplus

/** \addtogroup niLang
 * @{
 */

//! Log flags.
enum eLogFlags
{
  //! Raw type, log the message as-is without any formatting.
  eLogFlags_Raw = niBit(0),
  //! Debug log.
  eLogFlags_Debug = niBit(1),
  //! Info log.
  eLogFlags_Info = niBit(2),
  //! Warning log.
  eLogFlags_Warning = niBit(3),
  //! Error log.
  eLogFlags_Error = niBit(4),
  //! All types. (max 16 bits)
  eLogFlags_All = 0xFFFF,
  //! Format as a MSVC error message.
  eLogFlags_FormatMSVC = niBit(16),
  //! Do not call the log callback.
  eLogFlags_NoCallbackOutput = niBit(17),
  //! Do not output to the regular loggers, only the log callback can be called.
  eLogFlags_NoRegularOutput = niBit(18),
  //! If possible, do not append a new line.
  eLogFlags_NoNewLine = niBit(19),
  //! Outputs to stdout. Stderr is the default when not specified.
  eLogFlags_Stdout = niBit(20),
  //! Do not prefix with the log type.
  eLogFlags_NoLogTypePrefix = niBit(21),
  //! \internal
  eLogFlags_ForceDWORD = 0xFFFFFFFF
};

//! Log flags type.
//! \see ni::eLogFlags
typedef niTypeU32 tLogFlags;

//! Log message callback type, return false to not log in default outputs
typedef tBool (__ni_export_call_decl *tpfnLogMessage)(tLogFlags type, const tF64 afTime, const char* file, const char* func, int line, const char* msg);

niExportFunc(tU32) ni_log_set_filter(tU32 exclude);
niExportFunc(tU32) ni_log_get_filter();
niExportFunc(void) ni_log_set_callback(tpfnLogMessage);

niExportFunc(void) ni_log_system_info_once();

niExportFunc(void) ni_log(tLogFlags type, const char* file, const char* func, int line, const char* msg);

#  ifdef __cplusplus
niExportFunc(void) ni_log_format_message(cString& strOut,
                                         tU32 aType,
                                         const char* aaszFile,
                                         const ni::tU32 anLine,
                                         const char* aaszFunction,
                                         const char* aaszMsg,
                                         const tF64 afTime,
                                         const tF64 afPrevTime);
#  endif

#  define niLog_(FLAGS,MSG) ni::ni_log(FLAGS, __FILE__, __FUNCTION__, __LINE__, MSG)
#  define niLog(TYPE,MSG) niLog_(ni::eLogFlags_##TYPE, MSG)

#  define niInfo(desc) niLog(Info,desc)
#  define niTrace(desc) niLog(Debug,desc)
#  if defined _REDIST
#    define niError(desc)
#    define niWarning(desc)
#  else
#    define niError(desc)   niLog(Error,desc)
#    define niWarning(desc) niLog(Warning,desc)
#  endif // #ifdef _REDIST

#  define niCheck_(COND,MSG,RET)        if (!(COND)) { niError(MSG _A("Check '") _A(#COND) _A("' failed.")); return RET; }
#  define niCheck(COND,RET)             niCheck_(COND,_A(""),RET)
#  define niCheckIsOK_(PARAM,MSG,RET)   niCheck_(niIsOK(PARAM),MSG,RET)
#  define niCheckIsOK(COND,RET)         niCheckIsOK_(COND,_A(""),RET)
#  define niCheckSilent(COND,RET)       if (!(COND)) { return RET; }

#  ifdef niDebug
#    define niCheckAssert(COND,MSG,RET)     if (!(COND)) { niAssertMsg(COND,MSG); return RET; }
#  else
#    define niCheckAssert(COND,MSG,RET)     if (!(COND)) { return RET; }
#  endif

/**@}*/
#  ifdef __cplusplus
}
#  endif // __cplusplus
#endif // niShaderLanguage

//--------------------------------------------------------------------------------------------
//
//  Base mathematic definitions
//
//--------------------------------------------------------------------------------------------
#ifdef __cplusplus
namespace ni {
#endif // __cplusplus

/** \addtogroup niLang
 * @{
 */

#define niEpsilon0  1.0f
#define niEpsilon1  1e-1f
#define niEpsilon2  1e-2f
#define niEpsilon3  1e-3f
#define niEpsilon4  1e-4f
#define niEpsilon5  1e-5f
#define niEpsilon6  1e-6f
#define niEpsilon7  1e-7f
#define niEpsilon8  1e-8f
#define niEpsilon9  1e-9f
#define niEpsilon10 1e-10f
#define niEpsilon11 1e-11f
#define niEpsilon12 1e-12f

#define niEqualX(X, Y, eps) (niNamespace(ni,Abs)((X) - (Y)) < (eps))
#define niEqual0(X, Y)      (niNamespace(ni,Abs)((X) - (Y)) < niEpsilon0)
#define niEqual1(X, Y)      (niNamespace(ni,Abs)((X) - (Y)) < niEpsilon1)
#define niEqual2(X, Y)      (niNamespace(ni,Abs)((X) - (Y)) < niEpsilon2)
#define niEqual3(X, Y)      (niNamespace(ni,Abs)((X) - (Y)) < niEpsilon3)
#define niEqual4(X, Y)      (niNamespace(ni,Abs)((X) - (Y)) < niEpsilon4)
#define niEqual5(X, Y)      (niNamespace(ni,Abs)((X) - (Y)) < niEpsilon5)
#define niEqual6(X, Y)      (niNamespace(ni,Abs)((X) - (Y)) < niEpsilon6)
#define niEqual7(X, Y)      (niNamespace(ni,Abs)((X) - (Y)) < niEpsilon7)
#define niEqual8(X, Y)      (niNamespace(ni,Abs)((X) - (Y)) < niEpsilon8)
#define niEqual9(X, Y)      (niNamespace(ni,Abs)((X) - (Y)) < niEpsilon9)
#define niEqual10(X, Y)   (niNamespace(ni,Abs)((X) - (Y)) < niEpsilon10)
#define niEqual11(X, Y)   (niNamespace(ni,Abs)((X) - (Y)) < niEpsilon11)
#define niEqual12(X, Y)   (niNamespace(ni,Abs)((X) - (Y)) < niEpsilon12)

// float to float
#define niRound(X) ( (X) > 0.0f ?                           \
                     ( (float) ( (int) ( (X) + 0.5f) ) ) :  \
                     ( (float) ( (int) ( (X) - 0.5f) ) ) )

#define niRound0(X, I) ( ( (X) * (I) ) > 0.0f ?                         \
                         ( ( (float) ( (int) ( (X) * (I) + 0.5f) ) ) / (I) ): \
                         ( ( (float) ( (int) ( (X) * (I) - 0.5f) ) ) / (I) ) )
#define niRound1(X) (niRound0((X), 10.0f))
#define niRound2(X) (niRound0((X), 100.0f))
#define niRound3(X) (niRound0((X), 1000.0f))
#define niRound4(X) (niRound0((X), 10000.0f))
#define niRound5(X) (niRound0((X), 100000.0f))
#define niRound6(X) (niRound0((X), 1000000.0f))

// float to int
#define niRoundI(X) ((X) > 0.0f ? (((int) ((X) + 0.5f))) : (((int) ((X) - 0.5f))))

#define niPi     3.1415926535897932384626433832795028841971693993751 // 180 deg
#define niPif    3.1415926535897932384626433832795028841971693993751f // 180 deg
#define niPi2    1.5707963267948966192313216916395 // 90 deg
#define niPi2f   1.5707963267948966192313216916395f // 90 deg
#define niPi4    0.78539816339744830961566084581975 // 45 deg
#define niPi4f   0.78539816339744830961566084581975f // 45 deg
#define ni2Pi    6.283185307179586476925286766558 // 360 deg
#define ni2Pif   6.283185307179586476925286766558f // 360 deg
#define ni1ByPi  0.31830988618379067153776752674503 // (1.0f/niPi)
#define ni1ByPif 0.31830988618379067153776752674503f // (1.0f/niPi)
#define niE      2.71828182845904523536
#define niEf     2.71828182845904523536f

#define niRad(x) ((x)*(niPi/180))
#define niDeg(x) ((x)*(180/niPi))
#define niRadf(x) (((float)(x))*(niPif/180.0f))
#define niDegf(x) (((float)(x))*(180.0f/niPif))

#if !defined niShaderLanguage
niConstValue tF32 kfE = niEf;
niConstValue tF32 kPi = niPif;
niConstValue tF32 kPi2 = niPi2f;
niConstValue tF32 kPi4 = niPi4f;
niConstValue tF32 k2Pi = ni2Pif;
niConstValue tF32 k1ByPi = ni1ByPif;
niConstValue tF32 kInfinity = niMaxF32;
niConstValue tF32 kEpsilon = niEpsilon5;
#endif

#ifndef __cplusplus
#  define T niDefaultTypeT
#endif // __cplusplus
#ifdef niTypeF64
niDefaultTemplate static inline T Num(const tF64 a) { return (T)a; }
#endif
niDefaultTemplate static inline T Abs(const T a) {  return (a < ((T)(0))) ? -a : a; }
niDefaultTemplate static inline T Rad(const T a) {  return (T)niRad(a); }
niDefaultTemplate static inline T Deg(const T a) {  return (T)niDeg(a); }
niDefaultTemplate static inline T Floor(const T a) {  return (T)floor(a); }
niDefaultTemplate static inline T Ceil(const T a) { return (T)ceil(a);  }
niDefaultTemplate static inline T Sqrt(const T a) { return (T)sqrt(a);  }
niDefaultTemplate static inline T Sqr(const T a) {  return a*a; }
niDefaultTemplate static inline T Cube(const T a) { return a*a*a; }
niDefaultTemplate static inline T Sin(const T a) {  return (T)sin(a); }
niDefaultTemplate static inline T Sinh(const T a) { return (T)sinh(a);  }
niDefaultTemplate static inline T ASin(const T a) { return (T)asin(a);  }
niDefaultTemplate static inline T Cos(const T a) {  return (T)cos(a); }
niDefaultTemplate static inline T Cosh(const T a) { return (T)cosh(a);  }
niDefaultTemplate static inline T ACos(const T a) { return (T)acos(a);  }
niDefaultTemplate static inline T Tan(const T a) {  return (T)tan(a); }
niDefaultTemplate static inline T Tanh(const T a) { return (T)tanh(a);  }
niDefaultTemplate static inline T ATan(const T a) { return (T)atan(a);  }
niDefaultTemplate static inline T ATan2(const T a, const T b) { return (T)atan2(a,b); }
niDefaultTemplate static inline T FMod(const T a, const T b) {  return (T)fmod(a,b);  }
#ifdef __cplusplus
template<> inline tI32 FMod(const tI32 a, const tI32 b) {
  return a % b;
}
template<> inline tU32 FMod(const tU32 a, const tU32 b) {
  return a % b;
}
template<> inline tI64 FMod(const tI64 a, const tI64 b) {
  return a % b;
}
template<> inline tU64 FMod(const tU64 a, const tU64 b) {
  return a % b;
}
#  ifdef niTypeIntIsOtherType
template<> inline int FMod(const tInt a, const tInt b) {
  return a % b;
}
#  endif
#endif
niDefaultTemplate static inline T Pow(const T a, const T b) { return (T)pow(a,b); }
niDefaultTemplate static inline T Exp(const T a) {  return (T)exp(a); }
niDefaultTemplate static inline T LogE(const T a) { return (T)log(a); }
niDefaultTemplate static inline T LogX(const T base, const T a) { return (T)log(a)/(T)log(base);  }
niDefaultTemplate static inline T Log10(const T a) {  return (T)log10(a); }
niDefaultTemplate static inline T Log2(const T a) { return (T)log(a)/(T)log((T)2);  }
niDefaultTemplate static inline T Hypot(const T a, const T b) { return Sqrt(a*a + b*b); }
niDefaultTemplate static inline T Sign(T a) { return (a < (T)(0)) ? (T)(-1) : (T)(1); }
#ifdef __cplusplus
template<typename T, typename S> inline T Lerp(const T& a, const T& b, const S fac) { return a + ((b-a) * fac); }
#else
niDefaultTemplate static inline T Lerp(const T a, const T b, const T fac) { return a + ((b-a) * fac); }
#endif
niDefaultTemplate static inline T Pi()  { return (T)(niPi); }
niDefaultTemplate static inline T PiTwo() { return (T)(2*niPi); }
niDefaultTemplate static inline T PiHalf(){ return (T)(niPi/2); }
#ifndef __cplusplus
#  undef T
#endif // __cplusplus

#ifdef __cplusplus
///////////////////////////////////////////////
template <typename T>
inline T FInvert(const T v) {
#  ifdef niSafeFloatDiv
  return (v == T(0)) ? T(1) : T(1)/v;
#  else
  return T(1)/v;
#  endif
}

///////////////////////////////////////////////
template <typename T, typename S>
inline T FDiv(const T n, const S d) {
#  ifdef niSafeFloatDiv
  return (d == T(0)) ? T(1) : n/T(d);
#  else
  return n/T(d);
#  endif
}
#else // __cplusplus
///////////////////////////////////////////////
static inline niDefaultTypeT FInvert(const niDefaultTypeT v) {
#  ifdef niSafeFloatDiv
  return (v == niCCast(niDefaultTypeT,0)) ? niCCast(niDefaultTypeT,1) : niCCast(niDefaultTypeT,1)/v;
#  else
  return niCCast(niDefaultTypeT,1)/v;
#  endif
}

///////////////////////////////////////////////
static inline niDefaultTypeT FDiv(const niDefaultTypeT n, const niDefaultTypeT d) {
#  ifdef niSafeFloatDiv
  return (d == niCCast(niDefaultTypeT,0)) ? niCCast(niDefaultTypeT,1) : n/niCCast(niDefaultTypeT,d);
#  else
  return n/niCCast(niDefaultTypeT,d);
#  endif
}
#endif // __cplusplus

#define niBuildColor(r,g,b,a)                                     \
  ((((a)&0xFF)<<24)|(((r)&0xFF)<<16)|(((g)&0xFF)<<8)|((b)&0xFF))

static inline tU32 ULColorBuild(tU32 r, tU32 g, tU32 b, tU32 a niDefaultParam(0)) { return ((a&0xFF)<<24) | ((r&0xFF)<<16) | ((g&0xFF)<<8) | (b&0xFF);  }
static inline tU32 ULColorBuildf(tF32 r, tF32 g, tF32 b, tF32 a niDefaultParam(0.0f)) {  return (((tU32)(a*255.0f)&0xFF)<<24) | (((tU32)(r*255.0f)&0xFF)<<16) | (((tU32)(g*255.0f)&0xFF)<<8) | ((tU32)(b*255.0f)&0xFF); }

static inline tU8  ULColorGetA(tU32 color) {  return (tU8)((color>>24)&0xFF); }
static inline tU8  ULColorGetR(tU32 color) {  return (tU8)((color>>16)&0xFF); }
static inline tU8  ULColorGetG(tU32 color) {  return (tU8)((color>>8)&0xFF);  }
static inline tU8  ULColorGetB(tU32 color) {  return (tU8)((color)&0xFF);   }
static inline tF32 ULColorGetAf(tU32 color) { return (tF32)((color>>24)&0xFF)/255.0f; }
static inline tF32 ULColorGetRf(tU32 color) { return (tF32)((color>>16)&0xFF)/255.0f; }
static inline tF32 ULColorGetGf(tU32 color) { return (tF32)((color>>8)&0xFF)/255.0f;  }
static inline tF32 ULColorGetBf(tU32 color) { return (tF32)((color)&0xFF)/255.0f;   }
static inline tU32 ULColorSetR(tU32 anColor, tU8 anV) { return ULColorBuild(anV,ULColorGetG(anColor),ULColorGetB(anColor),ULColorGetA(anColor));  }
static inline tU32 ULColorSetG(tU32 anColor, tU8 anV) { return ULColorBuild(ULColorGetR(anColor),anV,ULColorGetB(anColor),ULColorGetA(anColor));  }
static inline tU32 ULColorSetB(tU32 anColor, tU8 anV) { return ULColorBuild(ULColorGetR(anColor),ULColorGetG(anColor),anV,ULColorGetA(anColor));  }
static inline tU32 ULColorSetA(tU32 anColor, tU8 anV) { return ULColorBuild(ULColorGetR(anColor),ULColorGetG(anColor),ULColorGetB(anColor),anV);  }
static inline tU32 ULColorSetRf(tU32 anColor, tF32 anV) { return ULColorBuild(((tU32)(anV*255.0f)&0xFF),ULColorGetG(anColor),ULColorGetB(anColor),ULColorGetA(anColor));  }
static inline tU32 ULColorSetGf(tU32 anColor, tF32 anV) { return ULColorBuild(ULColorGetR(anColor),((tU32)(anV*255.0f)&0xFF),ULColorGetB(anColor),ULColorGetA(anColor));  }
static inline tU32 ULColorSetBf(tU32 anColor, tF32 anV) { return ULColorBuild(ULColorGetR(anColor),ULColorGetG(anColor),((tU32)(anV*255.0f)&0xFF),ULColorGetA(anColor));  }
static inline tU32 ULColorSetAf(tU32 anColor, tF32 anV) { return ULColorBuild(ULColorGetR(anColor),ULColorGetG(anColor),ULColorGetB(anColor),((tU32)(anV*255.0f)&0xFF));  }
static inline tU32 ULColorLerp(tU32 ca, tU32 cb, tF32 fac) {
  tF32 aa = (tF32)((ca>>24)&0xFF),  ba = (tF32)((cb>>24)&0xFF);
  tF32 ar = (tF32)((ca>>16)&0xFF),  br = (tF32)((cb>>16)&0xFF);
  tF32 ag = (tF32)((ca>>8)&0xFF), bg = (tF32)((cb>>8)&0xFF);
  tF32 ab = (tF32)(ca&0xFF),    bb = (tF32)(cb&0xFF);
  return  ((tU8)((aa + ((ba-aa) * fac)))<<24) |
      ((tU8)((ar + ((br-ar) * fac)))<<16) |
      ((tU8)((ag + ((bg-ag) * fac)))<<8)  |
      ((tU8)((ab + ((bb-ab) * fac))));
}

#if defined niShaderLanguage

typedef metal::packed_float2 float2;
typedef metal::packed_float2 sVec2f;
#  define _v2f metal::float2
niCAssert(sizeof(sVec2f) == 8);

typedef metal::packed_float3 float3;
typedef metal::packed_float3 sVec3f;
#  define _v3f metal::float3
niCAssert(sizeof(sVec3f) == 12);

typedef metal::packed_float4 float4;
typedef metal::packed_float4 sVec4f;
#  define _v4f metal::float4
niCAssert(sizeof(sVec4f) == 16);

typedef metal::float4x4 float4x4;
typedef metal::float4x4 sMatrixf;
#  define _mtx metal::float4x4
niCAssert(sizeof(sMatrixf) == 64);

#elif defined __cplusplus

template <typename T>
inline T WrapFloat(T aX, T aMin, T aMax)
{
  const T r = (aMax-aMin);
  const T t = (aX-aMin) / r;
  return aMin + r * (t-ni::Floor(t));
}

template <typename T>
inline T WrapInt(T aX, T aMin, T aMax)
{
  if (aX < aMin) {
    const T range = aMax-aMin;
    aX -= aMin;
    return ((aX%range) + range) + aMin;
  }
  else if (aX >= aMax)  {
    const T range = aMax-aMin;
    aX -= aMin;
    return (aX%range) + aMin;
  }
  return aX;
}

template <typename T>
inline T WrapRad(T aX)
{
  return WrapFloat(aX, T(0), T(ni2Pi));
}

template <typename T>
inline T WrapRad2(T aX)
{
  return WrapFloat(aX, T(-niPif), T(niPif));
}

template <typename T>
int VectorCmp(const T* A, const T* B, const int SIZE) {
  for (int i = 0; i < SIZE; ++i) {
    if (A[i] < B[i]) return -1;
    if (A[i] > B[i]) return 1;
  }
  return 0;
}
template <typename T>
bool VectorEq(const T* A, const T* B, const int SIZE) {
